Garibel-Lee/NODEMCU-OlED_DEMO/Esp8266_Clock_Weather/HeFeng.cpp

#include <ESP8266WiFi.h>
#include <ESP8266HTTPClient.h>
#include <WiFiClientSecureBearSSL.h>
#include "HeFeng.h"

HeFeng::HeFeng() {
}

void HeFeng::fans(HeFengCurrentData *data, String id) {  //获取粉丝数
  std::unique_ptr<BearSSL::WiFiClientSecure>client(new BearSSL::WiFiClientSecure);
  client->setInsecure();
  HTTPClient https;
  String url = "https://api.bilibili.com/x/relation/stat?vmid=" + id;
  Serial.print("[HTTPS] begin...bilibili\n");
  if (https.begin(*client, url)) {  // HTTPS
    // start connection and send HTTP header
    int httpCode = https.GET();
    // httpCode will be negative on error
    if (httpCode > 0) {
      // HTTP header has been send and Server response header has been handled
      Serial.printf("[HTTPS] GET... code: %d\n", httpCode);

      if (httpCode == HTTP_CODE_OK || httpCode == HTTP_CODE_MOVED_PERMANENTLY) {
        String payload = https.getString();
        Serial.println(payload);
        DynamicJsonDocument  jsonBuffer(2048);
        deserializeJson(jsonBuffer, payload);
        JsonObject root = jsonBuffer.as<JsonObject>();

        String follower = root["data"]["follower"];
        data->follower = follower;
      }
    } else {
      Serial.printf("[HTTPS] GET... failed, error: %s\n", https.errorToString(httpCode).c_str());
      data->follower = "-1";
    }

    https.end();
  } else {
    Serial.printf("[HTTPS] Unable to connect\n");
    data->follower = "-1";
  }
}

void HeFeng::doUpdateCurr(HeFengCurrentData *data, String key, String location) {  //获取天气

  std::unique_ptr<BearSSL::WiFiClientSecure>client(new BearSSL::WiFiClientSecure);
  client->setInsecure();
  HTTPClient https;
  String url = "https://devapi.qweather.com/v7/weather/now?lang=en&gzip=n&location=" + location + "&key=" + key;
  Serial.print("[HTTPS] begin...now\n");
  if (https.begin(*client, url)) {  // HTTPS
    // start connection and send HTTP header
    int httpCode = https.GET();
    // httpCode will be negative on error
    if (httpCode > 0) {
      // HTTP header has been send and Server response header has been handled
      Serial.printf("[HTTPS] GET... code: %d\n", httpCode);

      if (httpCode == HTTP_CODE_OK || httpCode == HTTP_CODE_MOVED_PERMANENTLY) {
        String payload = https.getString();
        Serial.println(payload);
        DynamicJsonDocument  jsonBuffer(2048);
        deserializeJson(jsonBuffer, payload);
        JsonObject root = jsonBuffer.as<JsonObject>();

        String tmp = root["now"]["temp"];  //温度
        data->tmp = tmp;
        String fl = root["now"]["feelsLike"];  //体感温度
        data->fl = fl;
        String hum = root["now"]["humidity"];  //相对湿度
        data->hum = hum;
        String wind_sc = root["now"]["windScale"]; //风力
        data->wind_sc = wind_sc;
        String cond_code = root["now"]["icon"]; //天气图标
        String meteoconIcon = getMeteoconIcon(cond_code);
        String cond_txt = root["now"]["text"]; //图标说明
        data->cond_txt = cond_txt;
        data->iconMeteoCon = meteoconIcon;

      }
    } else {
      Serial.printf("[HTTPS] GET... failed, error: %s\n", https.errorToString(httpCode).c_str());
      data->tmp = "-1";
      data->fl = "-1";
      data->hum = "-1";
      data->wind_sc = "-1";
      data->cond_txt = "no network";
      data->iconMeteoCon = ")";
    }

    https.end();
  } else {
    Serial.printf("[HTTPS] Unable to connect\n");
    data->tmp = "-1";
    data->fl = "-1";
    data->hum = "-1";
    data->wind_sc = "-1";
    data->cond_txt = "no network";
    data->iconMeteoCon = ")";
  }

}

void HeFeng::doUpdateFore(HeFengForeData *data, String key, String location) {  //获取预报

  std::unique_ptr<BearSSL::WiFiClientSecure>client(new BearSSL::WiFiClientSecure);
  client->setInsecure();
  HTTPClient https;
  String url = "https://devapi.qweather.com/v7/weather/3d?lang=en&gzip=n&location=" + location + "&key=" + key;
  Serial.print("[HTTPS] begin...forecast\n");
  if (https.begin(*client, url)) {  // HTTPS
    // start connection and send HTTP header
    int httpCode = https.GET();
    // httpCode will be negative on error
    if (httpCode > 0) {
      // HTTP header has been send and Server response header has been handled
      Serial.printf("[HTTPS] GET... code: %d\n", httpCode);

      if (httpCode == HTTP_CODE_OK || httpCode == HTTP_CODE_MOVED_PERMANENTLY) {
        String payload = https.getString();
        Serial.println(payload);
        DynamicJsonDocument  jsonBuffer(2048);
        deserializeJson(jsonBuffer, payload);
        JsonObject root = jsonBuffer.as<JsonObject>();
        int i;
        for (i = 0; i < 3; i++) {
          String tmp_min = root["daily"][i]["tempMin"];
          data[i].tmp_min = tmp_min;
          String tmp_max = root["daily"][i]["tempMax"];
          data[i].tmp_max = tmp_max;
          String datestr = root["daily"][i]["fxDate"];
          data[i].datestr = datestr.substring(5, datestr.length());
          String test = root["daily"][i];
           Serial.println(test);
          String cond_code = root["daily"][i]["iconDay"];
          Serial.print(cond_code);
          String meteoconIcon = getMeteoconIcon(cond_code);
          Serial.println(meteoconIcon);
          data[i].iconMeteoCon = meteoconIcon;
        }
      }
    } else {
      Serial.printf("[HTTPS] GET... failed, error: %s\n", https.errorToString(httpCode).c_str());
      int i;
      for (i = 0; i < 3; i++) {
        data[i].tmp_min = "-1";
        data[i].tmp_max = "-1";
        data[i].datestr = "N/A";
        data[i].iconMeteoCon = ")";
      }
    }
    https.end();
  } else {
    Serial.printf("[HTTPS] Unable to connect\n");
    int i;
    for (i = 0; i < 3; i++) {
      data[i].tmp_min = "-1";
      data[i].tmp_max = "-1";
      data[i].datestr = "N/A";
      data[i].iconMeteoCon = ")";
    }
  }

}
/**
 * https://blog.csdn.net/weixin_42880082/article/details/112056586
 * https://dev.qweather.com/docs/start/icons/
 */
 String HeFeng::getMeteoconIcon(String cond_code) {
        if (cond_code == "100") {
            return "B";
        }
        if (cond_code == "101") {
            return "Y";
        }
        if (cond_code == "102") {
            return "N";
        }
        if (cond_code == "103") {
            return "H";
        }
        if (cond_code == "104") {
            return "H";
        }
        if (cond_code == "150") {
            return "2";
        }
        if (cond_code == "153") {
            return "4";
        }
        if (cond_code == "154") {
            return "4";
        }
        if (cond_code == "300") {
            return "Q";
        }
        if (cond_code == "301") {
            return "R";
        }
        if (cond_code == "302") {
            return "O";
        }
        if (cond_code == "303") {
            return "P";
        }
        if (cond_code == "304") {
            return "O";
        }
        if (cond_code == "305") {
            return "Q";
        }
        if (cond_code == "306") {
            return "R";
        }
        if (cond_code == "307") {
            return "R";
        }
        if (cond_code == "308") {
            return "R";
        }
        if (cond_code == "309" || cond_code == "314") {
            return "Q";
        }
        if (cond_code == "310" || cond_code == "311" || cond_code == "312" || cond_code == "313" || cond_code == "315" || cond_code == "316" || cond_code == "317") {
            return "R";
        }
        if (cond_code == "318") {
            return "8";
        }
        if (cond_code == "350") {
            return "7";
        }
        if (cond_code == "351") {
            return "8";
        }
        if (cond_code == "399") {
            return "Q";
        }
        if (cond_code == "400") {
            return "U";
        }
        if (cond_code == "402") {
            return "V";
        }
        if (cond_code == "403") {
            return "V";
        }
        if (cond_code == "404") {
            return "V";
        }
        if (cond_code == "405") {
            return "X";
        }
        if (cond_code == "406") {
            return "U";
        }
        if (cond_code == "407") {
            return "U";
        }
        if (cond_code == "408") {
            return "U";
        }
        if (cond_code == "409") {
            return "V";
        }
        if (cond_code == "410") {
            return "V";
        }
        if (cond_code == "456") {
            return "U";
        }
        if (cond_code == "457") {
            return "V";
        }
        if (cond_code == "459") {
            return "W";
        }
        if (cond_code == "500") {
            return "E";
        }
        if (cond_code == "501" || cond_code == "502" || cond_code == "503" || cond_code == "504" || cond_code == "509" || cond_code == "510" || cond_code == "511" || cond_code == "512" || cond_code == "513" || cond_code == "514" || cond_code == "515" || cond_code == "514") {
            return "M";
        }
        if (cond_code == "507") {
            return "F";
        }
        if (cond_code == "508") {
            return "N";
        }
        if (cond_code == "900" || cond_code == "901") {
            return "'";
        }
        return ")";
    }
